Data Types
===========

Redis는 5가지 데이터 타입을 지원합니다.

## Strings

Redis의 "String" 타입은 바이트들의 시퀀스입니다. 이 타입은 binary safe 하며, 이 뜻은, 어떤 특별한 종료 문자에 의해 결정되지 않은, 알려진 길이임을 뜻합니다. 즉, 당신은 한 문자열에 최대 512MB까지 저장할 수 있습니다.

### Example

문자열을 GET/SET 해보겠습니다. 터미널에 다음을 입력하세요.

```bash
# name 이란 키에 "gurumee" 문자열 저장
# SET <key> <value>
redis:6379> SET name "gurumee"
OK

# name 키에 저장된 값 GET
# GET <key>
redis:6379> GET name
"gurumee"
```

여기서 name은 Redis에서 사용되는 키이며, "gurumee"는 Redis가 저장하는 문자열 값입니다.


## Hashes

Redis에서 "Hash" 타입은 키-값 쌍들의 집합입니다. 이들은, 문자열 필드와 값 사이를 매핑시킵니다. 따라서 그들은 객체를 표현하는데 사용됩니다.

### Example

"hash"는 HMSET, HGETALL로 정보를 저장 및 가져올 수 있습니다. 터미널에 다음을 입력하세요.

```bash
# HMSET <key> <value1> <value2> <value...>
redis:6379> HMSET user:1 username tutorialspoint password tutorialspoint points 200
OK

# HGETALL <key>
redis:6379> HGETALL user:1
1) "username"
2) "tutorialspoint"
3) "password"
4) "tutorialspoint"
5) "points"
6) "200"
```

위의 예제에 따르면, hash 데이터 타입은 사용자의 기본 정보를 포함하는 사용작의 객체를 저장하는데 사용되었습니다. 여기서 HMSET, HGETALL은 Redis를 위한 명령어이먀. "user:1"이 키입니다. 모든 해시는 2^32-1개의 키-값 쌍을 저장할 수 있습니다.


## Lists

Redis의 "List" 타입은, 간단한 문자열들의 리스트입니다. 또한, 이들은 삽입 순서대로 정렬되어 있습니다. 당신은 리스트에 원소를 머리 혹은 꼬리에 추가할 수 있습니다.

### Example

```bash
# 리스트에 원소 삽입
# lpush <리스트 이름> <원소>
redis:6379> lpush mylist redis
(integer) 1
redis:6379> lpush mylist mongo
(integer) 2
redis:6379> lpush mylist rabbitmq
(integer) 3

# 리스트 출력
# lrange <리스트 이름> <시작 지점> <끝 지잠>
redis:6379> lrange mylist 0 10
1) "rabbitmq"
2) "mongo"
3) "redis"
```

리스트의 최대 길이는 2^32-1개입니다. 즉 원소를 2^32-1개를 저장할 수 있습니다.


## Sets

Redis의 "Set" 타입은 비 정렬된 문자열들의 집합입니다. Redis에서 당신은 Set에 원소를 상수 시간에 추가, 제거 및 테스트를 할 수 있습니다.

### Example

Set 타입은 sadd, smemeber 등으로 저장 및 조회를 할 수 있습니다. 터미널에 다음을 입력해주세요.

```bash
# 원소 추가
# sadd <SET 이름> <원소 이름>
redis:6379> sadd myset redis
(integer) 1
redis:6379> sadd myset mongo
(integer) 1
redis:6379> sadd myset mq
(integer) 1
# 동일 원소가 있다면, 추가되지 않는다.
redis:6379> sadd myset mq
(integer) 0

# Set 조회
# smemberes <SET 이름>
redis:6379> smembers myset
1) "mq"
2) "mongo"
3) "redis"
```

위의 예에서 "mq"를 2번 추가하지만, Set 타입에서는 중복 키를 저장하지 않기 때문에, 마지막 sadd의 반환값이 0, 실패한 것을 볼 수 있습니다. Set은 같은 키의 중복을 허락하지 않습니다. Set 타입 역시 List 타입 처럼 2^32-1개의 원소를 가질 수 있습니다.


## Sorted Sets

Redis의 "Sorted Set"은 "Set"타입과 유사합니다. 차이점은 모든 원소가, 가장 작은 점수에서 큰 점수로 정려뢴 세트를 취하기 위해 사용되는 "score"와 연관되 있다는 것입니다. 원소는 고유하지만, score는 중복될 수 있습니다.

### Example

```bash
# sorted set 원소 추가
# zadd <Sorted Set 이름> <Score> <원소>
redis:6379> zadd myss 0 redis
(integer) 1
redis:6379> zadd myss 0 mongo
(integer) 1
redis:6379> zadd myss 0 mq
(integer) 1
# 역시 중복을 허락하지 않음
redis:6379> zadd myss 0 mq
(integer) 0

# score에 따른 Sorted Set 조회
# zrangebyscore <Sorted Set 이름> <시작 지점> <끝 지점>
redis:6379> zrangebyscore myss 0 10
1) "mongo"
2) "mq"
3) "redis"
```